-----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/jialiangchen/Desktop/econ-705/ps/problem_set2/ChenJialiangPS1.log
  log type:  text
 opened on:   9 Oct 2022, 18:46:33

. clear all;

. use Economics-705-Fall-2022-NJS-Data;

. *****************************************;
. * exploratory analysis;
. *****************************************;
. label list;
raclbl:
           1 White   
           2 Black   
           3 Hispanic
           4 Other   
sexlbl:
           0 Female
           1 Male  
raslbl:
           1 Trtment
           2 Control
sitlbl:
           1 CC
           2 CI
           3 CV
           4 HF
           5 IN
           6 JC
           7 JK
           8 LC
           9 MD
          10 MN
          11 MT
          12 NE
          13 OH
          14 OK
          15 PR
          16 SM

.  * list the underlying values of labeled variables;
. *****************************************;
. * Problems;
. *****************************************;
. preserve;

.  * restore data after termination;
. * Problem1;
. keep if sex == 0 & age >= 22;
(12,543 observations deleted)

.  * Keep only adult women;
. sum age sex;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         age |      8,058    33.29883     9.84961         22         82
         sex |      8,058           0           0          0          0

.  * safety check;
. * Problem2;
. gen treat = 1 if ra_stat == 1;
(2,605 missing values generated)

. replace treat = 0 if ra_stat == 2;
(2,605 real changes made)

. corr treat ra_stat;
(obs=8,058)

             |    treat  ra_stat
-------------+------------------
       treat |   1.0000
     ra_stat |  -1.0000   1.0000


.  * safety check;
. * Problem3;
. * Requires: ssc inst missings;
. missings report esum18i;

Checking missings in esum18i:
2333 observations with missing values

------------------
         |      #
---------+--------
 esum18i |   2333
------------------

.  * Report number of N/As;
. keep if !missing(esum18i);
(2,333 observations deleted)

.  * Drop missing observations with N/As;
. * Probelm4;
. * Show summary statistics by groups;
. bysort treat: sum age bfeduca bfyrearn;

-----------------------------------------------------------------------------------------------------------------------------
-> treat = 0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         age |      1,844    33.33948    9.931657         22         75
     bfeduca |      1,844    11.30043    2.412164          0         18
    bfyrearn |      1,844    1918.738    3209.271          0      30000

-----------------------------------------------------------------------------------------------------------------------------
-> treat = 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         age |      3,881    33.49343    9.924354         22         82
     bfeduca |      3,881    11.45968    2.249739          0         18
    bfyrearn |      3,881    1961.035    3262.643          0      46000


. * Problem5;
. * Balance tests for age, education and last year earning;
. foreach var in age bfeduca bfyrearn{;
  2.         ttest `var' , by(treat);
  3. };

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |   1,844    33.33948    .2312817    9.931657    32.88588    33.79308
       1 |   3,881    33.49343    .1593054    9.924354     33.1811    33.80576
---------+--------------------------------------------------------------------
Combined |   5,725    33.44384     .131187      9.9261    33.18667    33.70102
---------+--------------------------------------------------------------------
    diff |           -.1539501    .2807635               -.7043529    .3964526
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.5483
H0: diff = 0                                     Degrees of freedom =     5723

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.2917         Pr(|T| > |t|) = 0.5835          Pr(T > t) = 0.7083

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |   1,844    11.30043    .0561728    2.412164    11.19026     11.4106
       1 |   3,881    11.45968    .0361127    2.249739    11.38887    11.53048
---------+--------------------------------------------------------------------
Combined |   5,725    11.40838    .0304544    2.304297    11.34868    11.46809
---------+--------------------------------------------------------------------
    diff |           -.1592415    .0651456               -.2869516   -.0315314
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -2.4444
H0: diff = 0                                     Degrees of freedom =     5723

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0073         Pr(|T| > |t|) = 0.0145          Pr(T > t) = 0.9927

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |   1,844    1918.738    74.73533    3209.271    1772.163    2065.313
       1 |   3,881    1961.035    52.37183    3262.643    1858.356    2063.714
---------+--------------------------------------------------------------------
Combined |   5,725    1947.411    42.89146    3245.328    1863.328    2031.495
---------+--------------------------------------------------------------------
    diff |           -42.29672    91.79604               -222.2517    137.6583
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -0.4608
H0: diff = 0                                     Degrees of freedom =     5723

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.3225         Pr(|T| > |t|) = 0.6450          Pr(T > t) = 0.6775

. * Problem6;
. * Compute sample mean and variance by groups and save for later use;
. tabstat bfeduca, by(treat) stat(mean variance) save;

Summary for variables: bfeduca
Group variable: treat 

   treat |      Mean  Variance
---------+--------------------
       0 |  11.30043  5.818535
       1 |  11.45968  5.061325
---------+--------------------
   Total |  11.40838  5.309783
------------------------------

. return list;

macros:
              r(name2) : "1"
              r(name1) : "0"

matrices:
              r(Stat2) :  2 x 1
              r(Stat1) :  2 x 1
          r(StatTotal) :  2 x 1

. * Compute the Standardized difference;
. display 100 * (abs(r(Stat1)[1,1] - r(Stat2)[1,1])) / sqrt((r(Stat1)[2,1] + r(Stat2)[2,1])/2);
6.8274672

. * Problem7;
. ttest esum18i , by(treat);

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |   1,844    7470.984       180.2    7738.115    7117.567    7824.402
       1 |   3,881     8263.79    132.2658    8239.855    8004.473    8523.107
---------+--------------------------------------------------------------------
Combined |   5,725     8008.43    106.9133    8089.461     7798.84    8218.021
---------+--------------------------------------------------------------------
    diff |           -792.8057    228.5794               -1240.908   -344.7036
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -3.4684
H0: diff = 0                                     Degrees of freedom =     5723

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0003         Pr(|T| > |t|) = 0.0005          Pr(T > t) = 0.9997

. * Problem8;
. * Regression without conditional variables;
. reg esum18i treat;

      Source |       SS           df       MS      Number of obs   =     5,725
-------------+----------------------------------   F(1, 5723)      =     12.03
       Model |   785710629         1   785710629   Prob > F        =    0.0005
    Residual |  3.7379e+11     5,723  65313527.9   R-squared       =    0.0021
-------------+----------------------------------   Adj R-squared   =    0.0019
       Total |  3.7458e+11     5,724  65439383.5   Root MSE        =    8081.7

------------------------------------------------------------------------------
     esum18i | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       treat |   792.8057   228.5794     3.47   0.001     344.7036    1240.908
       _cons |   7470.984   188.2006    39.70   0.000      7102.04    7839.929
------------------------------------------------------------------------------

. * Problem9;
. * Regression with conditional variables;
. reg esum18i treat i.sex i.race age totch18 bfeduca bfyrearn i.site_num child_miss ed_miss earn_miss;
note: 0.sex omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =     5,725
-------------+----------------------------------   F(26, 5698)     =     29.04
       Model |  4.3824e+10        26  1.6855e+09   Prob > F        =    0.0000
    Residual |  3.3075e+11     5,698  58046837.5   R-squared       =    0.1170
-------------+----------------------------------   Adj R-squared   =    0.1130
       Total |  3.7458e+11     5,724  65439383.5   Root MSE        =    7618.8

------------------------------------------------------------------------------
     esum18i | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       treat |    694.606   215.8322     3.22   0.001     271.4928    1117.719
             |
         sex |
     Female  |          0  (omitted)
             |
        race |
   Black     |  -1372.524   303.3384    -4.52   0.000    -1967.182   -777.8652
   Hispanic  |  -1188.878   429.0816    -2.77   0.006    -2030.041   -347.7143
   Other     |   237.6442    641.632     0.37   0.711    -1020.199    1495.487
             |
         age |  -43.69301   10.58349    -4.13   0.000    -64.44069   -22.94534
     totch18 |   10.39796   74.79238     0.14   0.889    -136.2236    157.0195
     bfeduca |   561.4765   59.46868     9.44   0.000     444.8953    678.0577
    bfyrearn |   .6461661   .0331443    19.50   0.000     .5811907    .7111415
             |
    site_num |
         CI  |   417.1486   840.9806     0.50   0.620    -1231.493     2065.79
         CV  |     883.71   544.6647     1.62   0.105    -184.0399     1951.46
         HF  |   141.5004   707.7708     0.20   0.842        -1246        1529
         IN  |   1993.828   526.6848     3.79   0.000     961.3251     3026.33
         JC  |  -113.0637   583.5776    -0.19   0.846    -1257.098     1030.97
         JK  |  -221.6342    629.213    -0.35   0.725    -1455.131    1011.863
         LC  |  -345.0588   623.8046    -0.55   0.580    -1567.953    877.8355
         MD  |   1127.085   753.1417     1.50   0.135    -349.3597    2603.529
         MN  |  -1235.627    781.228    -1.58   0.114    -2767.131    295.8769
         MT  |    19.4676   748.8647     0.03   0.979    -1448.592    1487.527
         NE  |  -315.0279   577.3373    -0.55   0.585    -1446.829    816.7728
         OH  |  -2505.098    607.537    -4.12   0.000    -3696.102   -1314.095
         OK  |   150.8803    589.139     0.26   0.798    -1004.056    1305.817
         PR  |   597.3182   574.0689     1.04   0.298    -528.0754    1722.712
         SM  |   895.9612   614.4126     1.46   0.145    -308.5213    2100.444
             |
  child_miss |    224.997   355.6732     0.63   0.527    -472.2578    922.2518
     ed_miss |    5506.04   1064.097     5.17   0.000     3420.004    7592.076
   earn_miss |   1316.211   274.2588     4.80   0.000     778.5599    1853.863
       _cons |   1218.393   946.6804     1.29   0.198    -637.4612    3074.246
------------------------------------------------------------------------------

. * Problem10;
. * Display marginal distribution;
. tabulate treat enroll ,row;

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |        enroll
     treat |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,795         49 |     1,844 
           |     97.34       2.66 |    100.00 
-----------+----------------------+----------
         1 |     1,324      2,557 |     3,881 
           |     34.11      65.89 |    100.00 
-----------+----------------------+----------
     Total |     3,119      2,606 |     5,725 
           |     54.48      45.52 |    100.00 

. * Problem11;
. * Two Stage Least Square Regression with endo-variables enroll and iv treat;
. ivregress 2sls esum18i i.sex i.race age totch18 bfeduca bfyrearn i.site_num child_miss ed_miss earn_miss (enroll = treat);
note: 0.sex omitted because of collinearity.

Instrumental variables 2SLS regression            Number of obs   =      5,725
                                                  Wald chi2(26)   =     757.97
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1163
                                                  Root MSE        =     7603.8

------------------------------------------------------------------------------
     esum18i | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      enroll |   1100.105   341.1568     3.22   0.001     431.4497     1768.76
             |
         sex |
     Female  |          0  (omitted)
             |
        race |
   Black     |  -1333.711   302.9382    -4.40   0.000    -1927.459   -739.9634
   Hispanic  |  -1211.745    428.294    -2.83   0.005    -2051.186   -372.3047
   Other     |   201.1035   640.6488     0.31   0.754    -1054.545    1456.752
             |
         age |  -43.01076   10.56353    -4.07   0.000     -63.7149   -22.30663
     totch18 |    2.17588   74.68976     0.03   0.977    -144.2134    148.5651
     bfeduca |   559.8062   59.36444     9.43   0.000      443.454    676.1584
    bfyrearn |   .6455991   .0330807    19.52   0.000     .5807621    .7104361
             |
    site_num |
         CI  |   374.8322   839.4243     0.45   0.655    -1270.409    2020.074
         CV  |   894.0462   543.5825     1.64   0.100    -171.3559    1959.448
         HF  |   305.3579   707.3812     0.43   0.666    -1081.084      1691.8
         IN  |   2083.338    526.032     3.96   0.000     1052.334    3114.342
         JC  |   29.63257    584.019     0.05   0.960    -1115.024    1174.289
         JK  |  -331.7585   629.0925    -0.53   0.598    -1564.757    901.2402
         LC  |  -476.9555   624.2185    -0.76   0.445    -1700.401    746.4903
         MD  |   1034.862   752.6918     1.37   0.169    -440.3871    2510.111
         MN  |  -1129.216   779.9591    -1.45   0.148    -2657.908    399.4756
         MT  |  -180.9858   751.0375    -0.24   0.810    -1652.992    1291.021
         NE  |  -210.9346   576.9203    -0.37   0.715    -1341.678    919.8085
         OH  |  -2510.796   606.3665    -4.14   0.000    -3699.252   -1322.339
         OK  |   150.5807   587.9773     0.26   0.798    -1001.834    1302.995
         PR  |   666.3631   572.9794     1.16   0.245     -456.656    1789.382
         SM  |   943.4131   613.3306     1.54   0.124    -258.6928    2145.519
             |
  child_miss |   262.9809   355.2495     0.74   0.459    -433.2953    959.2571
     ed_miss |   5452.102   1062.077     5.13   0.000     3370.469    7533.735
   earn_miss |   1329.774   273.6596     4.86   0.000      793.411    1866.137
       _cons |   1161.081   947.2895     1.23   0.220    -695.5727    3017.734
------------------------------------------------------------------------------
Instrumented: enroll
 Instruments: 2.race 3.race 4.race age totch18 bfeduca bfyrearn 2.site_num
              3.site_num 4.site_num 5.site_num 6.site_num 7.site_num
              8.site_num 9.site_num 10.site_num 11.site_num 12.site_num
              13.site_num 14.site_num 15.site_num 16.site_num child_miss
              ed_miss earn_miss treat

. * Problem12;
. * Compute conditional expectations;
. bysort treat enroll: sum bfeduca;

-----------------------------------------------------------------------------------------------------------------------------
-> treat = 0, enroll = 0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     bfeduca |      1,795    11.30084    2.418522          0         18

-----------------------------------------------------------------------------------------------------------------------------
-> treat = 0, enroll = 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     bfeduca |         49    11.28571    2.188988          0         14

-----------------------------------------------------------------------------------------------------------------------------
-> treat = 1, enroll = 0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     bfeduca |      1,324    11.39653    2.247838          0         18

-----------------------------------------------------------------------------------------------------------------------------
-> treat = 1, enroll = 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     bfeduca |      2,557    11.49237    2.250465          0         18


. sum bfeduca;

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     bfeduca |      5,725    11.40838    2.304297          0         18

. * Compute complier characteristics mean;
. di (11.40838 -  (49/5725)*11.28571 - (1324/5725)*11.39653)/(1 - (49/5725) - (1324/5725));
11.413366

.  * a bit hardcode;
. * Problem13;
. * Create a binary indicator for "age less than or equal to 31";
. gen agele31 = 1 if age <= 31;
(2,694 missing values generated)

. replace agele31 = 0 if age > 31;
(2,694 real changes made)

. * Problem14;
. * Experimental impact for younger individuals, estimaing separately;
. reg esum18i treat i.sex i.race age totch18 bfeduca bfyrearn i.site_num child_miss ed_miss earn_miss if agele31 == 1;
note: 0.sex omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =     3,031
-------------+----------------------------------   F(26, 3004)     =     17.14
       Model |  2.5543e+10        26   982441686   Prob > F        =    0.0000
    Residual |  1.7215e+11     3,004  57306853.1   R-squared       =    0.1292
-------------+----------------------------------   Adj R-squared   =    0.1217
       Total |  1.9769e+11     3,030  65245303.8   Root MSE        =    7570.1

------------------------------------------------------------------------------
     esum18i | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       treat |   671.8341    294.427     2.28   0.023     94.53514    1249.133
             |
         sex |
     Female  |          0  (omitted)
             |
        race |
   Black     |  -2093.648    415.507    -5.04   0.000    -2908.355   -1278.941
   Hispanic  |  -1020.728   593.1992    -1.72   0.085    -2183.845    142.3902
   Other     |  -107.1243   1031.083    -0.10   0.917    -2128.825    1914.576
             |
         age |  -34.24605   49.97661    -0.69   0.493    -132.2379    63.74578
     totch18 |  -202.7888   114.8298    -1.77   0.077    -427.9418    22.36423
     bfeduca |   699.7682   88.69292     7.89   0.000     525.8632    873.6732
    bfyrearn |    .654483   .0519691    12.59   0.000     .5525843    .7563817
             |
    site_num |
         CI  |   1557.597   1117.243     1.39   0.163    -633.0411    3748.235
         CV  |   1448.719   753.5285     1.92   0.055    -28.76516    2926.203
         HF  |   171.6462   949.4219     0.18   0.857    -1689.937    2033.229
         IN  |   2847.936   742.2049     3.84   0.000     1392.654    4303.217
         JC  |   503.2791    766.717     0.66   0.512    -1000.064    2006.622
         JK  |   821.5479   821.8461     1.00   0.318    -789.8901    2432.986
         LC  |  -936.1932   923.5281    -1.01   0.311    -2747.005    874.6183
         MD  |   -24.6682   1092.158    -0.02   0.982     -2166.12    2116.784
         MN  |  -1038.692   1184.321    -0.88   0.381    -3360.855     1283.47
         MT  |    978.361    1030.96     0.95   0.343    -1043.098     2999.82
         NE  |   885.7514    782.586     1.13   0.258    -648.7072     2420.21
         OH  |  -2773.443    843.932    -3.29   0.001    -4428.186     -1118.7
         OK  |   2467.397   854.4983     2.89   0.004     791.9364    4142.858
         PR  |    573.405   798.9258     0.72   0.473     -993.092    2139.902
         SM  |   724.8239   836.0529     0.87   0.386    -914.4703    2364.118
             |
  child_miss |  -614.9002   528.5123    -1.16   0.245    -1651.183    421.3824
     ed_miss |    8415.63   1636.815     5.14   0.000     5206.239    11625.02
   earn_miss |   1410.132   373.5485     3.77   0.000      677.695    2142.568
       _cons |  -730.0887   1733.509    -0.42   0.674    -4129.074    2668.897
------------------------------------------------------------------------------

. * Experimental impact for older individuals, estimaing separately;
. reg esum18i treat i.sex i.race age totch18 bfeduca bfyrearn i.site_num child_miss ed_miss earn_miss if agele31 == 0;
note: 0.sex omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =     2,694
-------------+----------------------------------   F(26, 2667)     =     14.87
       Model |  2.2395e+10        26   861358698   Prob > F        =    0.0000
    Residual |  1.5446e+11     2,667  57915248.5   R-squared       =    0.1266
-------------+----------------------------------   Adj R-squared   =    0.1181
       Total |  1.7686e+11     2,693    65672222   Root MSE        =    7610.2

------------------------------------------------------------------------------
     esum18i | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       treat |   705.9442   316.3022     2.23   0.026     85.72181    1326.167
             |
         sex |
     Female  |          0  (omitted)
             |
        race |
   Black     |  -495.5682   445.8052    -1.11   0.266    -1369.727    378.5906
   Hispanic  |   -1458.64    619.731    -2.35   0.019    -2673.842   -243.4382
   Other     |   752.5014   822.2814     0.92   0.360    -859.8723    2364.875
             |
         age |  -64.15724   18.76025    -3.42   0.001    -100.9433   -27.37114
     totch18 |   120.9556   109.3132     1.11   0.269    -93.39161    335.3029
     bfeduca |   432.4088   80.98374     5.34   0.000     273.6115     591.206
    bfyrearn |    .624283   .0431974    14.45   0.000     .5395791    .7089869
             |
    site_num |
         CI  |  -986.4912   1279.277    -0.77   0.441    -3494.966    1521.983
         CV  |   357.5784   786.0378     0.45   0.649    -1183.727    1898.884
         HF  |   358.3645   1059.218     0.34   0.735    -1718.607    2435.336
         IN  |   1182.505   746.1024     1.58   0.113    -280.4927    2645.503
         JC  |  -553.7367   913.7087    -0.61   0.545    -2345.386    1237.913
         JK  |  -1537.156   1001.367    -1.54   0.125     -3500.69    426.3773
         LC  |  -71.65977   849.7684    -0.08   0.933    -1737.931    1594.612
         MD  |   2000.856   1038.256     1.93   0.054    -35.01263    4036.724
         MN  |  -1571.445   1048.267    -1.50   0.134    -3626.944    484.0536
         MT  |  -1167.472   1084.936    -1.08   0.282    -3294.874    959.9293
         NE  |   -1619.51   853.1519    -1.90   0.058    -3292.416    53.39614
         OH  |  -2125.916   872.3117    -2.44   0.015    -3836.392   -415.4403
         OK  |  -1686.259   820.9576    -2.05   0.040    -3296.037   -76.48141
         PR  |    631.224   820.3908     0.77   0.442    -977.4426    2239.891
         SM  |    1313.53   907.6089     1.45   0.148    -466.1584    3093.218
             |
  child_miss |   846.9519   489.8931     1.73   0.084    -113.6568    1807.561
     ed_miss |   3081.917   1403.921     2.20   0.028     329.0331      5834.8
   earn_miss |   1255.881   403.7365     3.11   0.002     464.2122    2047.549
       _cons |   3882.634   1464.332     2.65   0.008     1011.293    6753.974
------------------------------------------------------------------------------

. * Experimental impacts for two groups, estimaing collectively by interaction;
. reg esum18i treat#agele31 agele31 i.sex i.race age totch18 bfeduca bfyrearn i.site_num child_miss ed_miss earn_miss;
note: 1.treat#1.agele31 omitted because of collinearity.
note: 0.sex omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =     5,725
-------------+----------------------------------   F(28, 5696)     =     27.34
       Model |  4.4374e+10        28  1.5848e+09   Prob > F        =    0.0000
    Residual |  3.3020e+11     5,696  57970762.3   R-squared       =    0.1185
-------------+----------------------------------   Adj R-squared   =    0.1141
       Total |  3.7458e+11     5,724  65439383.5   Root MSE        =    7613.9

-------------------------------------------------------------------------------
      esum18i | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
treat#agele31 |
         0 1  |   -671.712   295.5904    -2.27   0.023    -1251.182   -92.24238
         1 0  |    715.863   315.6942     2.27   0.023     96.98214    1334.744
         1 1  |          0  (omitted)
              |
      agele31 |  -279.6469   395.6941    -0.71   0.480    -1055.358    496.0641
              |
          sex |
      Female  |          0  (omitted)
              |
         race |
    Black     |  -1370.408   303.1789    -4.52   0.000    -1964.754   -776.0621
    Hispanic  |   -1184.18   428.8188    -2.76   0.006    -2024.828   -343.5322
    Other     |   197.5258   641.4325     0.31   0.758    -1059.926    1454.978
              |
          age |  -82.20894   16.38448    -5.02   0.000    -114.3288   -50.08913
      totch18 |  -31.83632   75.99965    -0.42   0.675    -180.8246    117.1519
      bfeduca |   556.7613   59.46514     9.36   0.000      440.187    673.3356
     bfyrearn |    .641433   .0331599    19.34   0.000      .576427     .706439
              |
     site_num |
          CI  |   502.9641   840.9675     0.60   0.550    -1145.652     2151.58
          CV  |   965.1732   545.0075     1.77   0.077    -103.2489    2033.595
          HF  |   203.9227   707.6267     0.29   0.773    -1183.295     1591.14
          IN  |   2072.995   527.0645     3.93   0.000     1039.748    3106.242
          JC  |  -38.99961   583.8148    -0.07   0.947    -1183.499      1105.5
          JK  |  -144.5129   629.3272    -0.23   0.818    -1378.234    1089.208
          LC  |  -375.0511   623.6069    -0.60   0.548    -1597.558    847.4559
          MD  |   1153.728   753.0977     1.53   0.126    -322.6296    2630.087
          MN  |  -1125.116   781.5784    -1.44   0.150    -2657.307    407.0755
          MT  |   36.58543   748.5026     0.05   0.961    -1430.765    1503.935
          NE  |  -259.0858   577.2455    -0.45   0.654    -1390.707    872.5351
          OH  |  -2439.184   607.5316    -4.01   0.000    -3630.177   -1248.191
          OK  |   239.5546   589.5712     0.41   0.685    -916.2294    1395.339
          PR  |   626.2203   573.7935     1.09   0.275    -498.6334    1751.074
          SM  |    966.456   614.4498     1.57   0.116    -238.0994    2171.011
              |
   child_miss |   128.3791   356.8249     0.36   0.719    -571.1335    827.8916
      ed_miss |   5455.691   1063.891     5.13   0.000      3370.06    7541.323
    earn_miss |   1323.846    274.091     4.83   0.000     786.5235    1861.169
        _cons |   3090.601   1133.755     2.73   0.006     868.0099    5313.192
-------------------------------------------------------------------------------

. * Problem15;
. * Compare the standard deviation of earnings;
. tabstat esum18i, by(treat) stat(sd);

Summary for variables: esum18i
Group variable: treat 

   treat |        SD
---------+----------
       0 |  7738.115
       1 |  8239.855
---------+----------
   Total |  8089.461
--------------------

. sdtest esum18i, by(treat);

Variance ratio test
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
       0 |   1,844    7470.984       180.2    7738.115    7117.567    7824.402
       1 |   3,881     8263.79    132.2658    8239.855    8004.473    8523.107
---------+--------------------------------------------------------------------
Combined |   5,725     8008.43    106.9133    8089.461     7798.84    8218.021
------------------------------------------------------------------------------
    ratio = sd(0) / sd(1)                                         f =   0.8819
H0: ratio = 1                                  Degrees of freedom = 1843, 3880

    Ha: ratio < 1               Ha: ratio != 1                 Ha: ratio > 1
  Pr(F < f) = 0.0009         2*Pr(F < f) = 0.0019           Pr(F > f) = 0.9991

.  * test the null of equal variances;
. * Problem16;
. * Estimate 75th quantile effect;
. bysort treat: centile esum18i, centile(75);

-----------------------------------------------------------------------------------------------------------------------------
-> treat = 0

                                                          Binom. interp.   
    Variable |       Obs  Percentile    Centile        [95% conf. interval]
-------------+-------------------------------------------------------------
     esum18i |     1,844         75     12227.5        11633.09    12941.91

-----------------------------------------------------------------------------------------------------------------------------
-> treat = 1

                                                          Binom. interp.   
    Variable |       Obs  Percentile    Centile        [95% conf. interval]
-------------+-------------------------------------------------------------
     esum18i |     3,881         75       13197        12828.98    13636.65

. di 13197 -  12227.5;
969.5

.  * more hardcode;
. * Problem17;
. * generate binary employ = 1 if esum18i > 0;
. gen employ = 1 if esum18i > 0;
(1,227 missing values generated)

. replace employ = 0 if esum18i <= 0;
(1,227 real changes made)

. * Problem18;
. * Display marginal distribution;
. tabulate treat employ,row col;

+-------------------+
| Key               |
|-------------------|
|     frequency     |
|  row percentage   |
| column percentage |
+-------------------+

           |        employ
     treat |         0          1 |     Total
-----------+----------------------+----------
         0 |       433      1,411 |     1,844 
           |     23.48      76.52 |    100.00 
           |     35.29      31.37 |     32.21 
-----------+----------------------+----------
         1 |       794      3,087 |     3,881 
           |     20.46      79.54 |    100.00 
           |     64.71      68.63 |     67.79 
-----------+----------------------+----------
     Total |     1,227      4,498 |     5,725 
           |     21.43      78.57 |    100.00 
           |    100.00     100.00 |    100.00 

. log close
> 
> 
> 

end of do-file

. exit
